[
  {
    "event_id": 0,
    "temp_c": 21.8,
    "humidity_pct": 41.0,
    "note": "2025-10-14T21:08:00Z Began walk from 370 Jay St.; air temperate—neither hot nor cold; calm and windless; few pedestrians and bikes; light traffic. Sight: sparse people, newly painted trash can. Emotion: relaxed, observant."
  },
  {
    "event_id": 1,
    "temp_c": 21.7,
    "humidity_pct": 44.0,
    "note": "2025-10-14T21:10:00Z Slight breeze desired but absent; quiet street with soft urban hum. Sight: patchy light from construction zones; Sound: low, rhythmic traffic; Touch: still air. Emotion: contemplative calm."
  },
  {
    "event_id": 2,
    "temp_c": 20.7,
    "humidity_pct": 50.0,
    "note": "2025-10-14T21:12:00Z Turned left; bright streetlights except under scaffolding; sparse trees; faint smell of chicken. Sight: contrast between lit and shaded zones. Sound: motorcycles, a few cars. Emotion: steady awareness."
  },
  {
    "event_id": 3,
    "temp_c": 19.6,
    "humidity_pct": 57.0,
    "note": "2025-10-14T21:14:00Z Humidity noticeable; pedestrians thinning; stores closing; breeze from back/right side. Touch: damp, soft air; Smell: faint food aroma fading. Emotion: quiet, slightly solitary."
  },
  {
    "event_id": 4,
    "temp_c": 19.2,
    "humidity_pct": 60.0,
    "note": "2025-10-14T21:16:00Z Wind shifting to face; well-lit wide road feels safe. Sound: mostly buses, few honks. Touch: cool air brushing face. Emotion: secure, rhythmic pace."
  },
  {
    "event_id": 5,
    "temp_c": 18.5,
    "humidity_pct": 62.0,
    "note": "2025-10-14T21:18:00Z Passed loud trash truck—mechanical roar fills air; mixed smells and clutter. Sight: broad, busy streets; Sound: heavy urban noise. Emotion: slightly tense but alert."
  },
  {
    "event_id": 6,
    "temp_c": 17.8,
    "humidity_pct": 66.0,
    "note": "2025-10-14T21:20:00Z Near Target—bright lights, steady breeze cooling the skin. Sight: glowing storefronts; Sound: chatter of young shoppers. Emotion: social energy, comfort."
  },
  {
    "event_id": 7,
    "temp_c": 17.6,
    "humidity_pct": 68.0,
    "note": "2025-10-14T21:22:00Z Sudden gust—refreshing yet headache-inducing; trees blocking lights; semi-dark. Touch: strong wind; Sight: flickering shadows. Emotion: invigorated but strained."
  },
  {
    "event_id": 8,
    "temp_c": 17.4,
    "humidity_pct": 69.0,
    "note": "2025-10-14T21:24:00Z Paused at traffic light; intersection louder, busier; wind drying skin. Sound: layered car engines and conversations. Emotion: present but slightly overstimulated."
  },
  {
    "event_id": 9,
    "temp_c": 17.1,
    "humidity_pct": 70.0,
    "note": "2025-10-14T21:26:00Z Construction-covered sidewalks; dim corners; smell of fried food (Popeyes/Subway). Sight: neon reflections on wet pavement. Emotion: sensory clutter, mild fatigue."
  },
  {
    "event_id": 10,
    "temp_c": 16.8,
    "humidity_pct": 71.0,
    "note": "2025-10-14T21:28:00Z Under scaffolding again; poor lighting, harsh glare from headlights. Sight: high contrast glare and shadow; Sound: rumble of passing cars. Emotion: uneasy focus."
  },
  {
    "event_id": 11,
    "temp_c": 16.7,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:30:00Z Near Brooklyn Public Library / Whole Foods; gentle wind; subway vibration underfoot. Touch: ground trembling lightly; Sound: faint rumble below. Emotion: grounded calm."
  },
  {
    "event_id": 12,
    "temp_c": 16.9,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:32:00Z Wearing wind-resistant coat dulls tactile cues; still air. Sight: open space, steady glow. Emotion: neutral, slightly detached."
  },
  {
    "event_id": 13,
    "temp_c": 17.1,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:34:00Z At Whole Foods plaza; decorative tree lights; open cross-breezes. Sight: festive lighting; Touch: shifting cool air. Emotion: refreshed, observant."
  },
  {
    "event_id": 14,
    "temp_c": 17.1,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:36:00Z Passing food trucks near Atlantic Terminal; louder again, commercial lighting intense. Sound: crowd noise, clatter of vendors. Emotion: energized but distracted."
  },
  {
    "event_id": 15,
    "temp_c": 17.1,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:38:00Z Large mall and second Target; turning left toward dimmer residential road. Sight: lighting fading; Sound: traffic slowing. Emotion: easing into quiet."
  },
  {
    "event_id": 16,
    "temp_c": 17.2,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:40:00Z Near Barclays Center; slower car flow; fewer shops. Sight: wide avenue thinning into smaller buildings. Emotion: transitional calm."
  },
  {
    "event_id": 17,
    "temp_c": 17.3,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:42:00Z Entering darker area; fewer streetlights; quiet wide road. Sight: light diminishing; Sound: muted background. Emotion: solitude, subtle unease."
  },
  {
    "event_id": 18,
    "temp_c": 17.2,
    "humidity_pct": 71.0,
    "note": "2025-10-14T21:44:00Z Drastic drop in light near rail line; almost silent; noticing footsteps. Sound: self-footsteps amplified. Emotion: alert, cautious."
  },
  {
    "event_id": 19,
    "temp_c": 17.0,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:46:00Z Distant sirens; taller residential towers appear; greenery denser. Sight: silhouettes of trees; Emotion: returning sense of habitation."
  },
  {
    "event_id": 20,
    "temp_c": 17.0,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:48:00Z Entered well-lit playground; visibility improves; quickened pace toward home. Touch: cooler breeze. Emotion: relief."
  },
  {
    "event_id": 21,
    "temp_c": 16.9,
    "humidity_pct": 72.0,
    "note": "2025-10-14T21:50:00Z Lower, damper trees; humid gentle wind; reflective calm. Touch: moist air; Emotion: peaceful introspection."
  },
  {
    "event_id": 22,
    "temp_c": 16.8,
    "humidity_pct": 73.0,
    "note": "2025-10-14T21:52:00Z Passing insulation site; fewer stimuli; focus shifts to ground tidiness. Sight: sparse street activity. Emotion: fading attention."
  },
  {
    "event_id": 23,
    "temp_c": 16.7,
    "humidity_pct": 73.0,
    "note": "2025-10-14T21:54:00Z Near home; quiet; observation fading into closure. Sound: minimal ambient noise. Emotion: reflective calm."
  },
  {
    "event_id": 24,
    "temp_c": 16.6,
    "humidity_pct": 74.0,
    "note": "2025-10-14T21:56:00Z At building entrance; faint voices nearby; wrapping up mentally. Emotion: completion, familiarity."
  },
  {
    "event_id": 25,
    "temp_c": 16.6,
    "humidity_pct": 74.0,
    "note": "2025-10-14T21:58:00Z Arrived home safely; end of walk. Emotion: closure, comfort."
  }
]
